/********************************************************************************	*
*                    кафедра № 304 1 курс 1 семестр информатика						*
*--------------------------------------------------------------------------------	*
*	Project type : solution															*
*	Project name : lw2																*
*	File name    : main.cpp															*
*	Language     : c/c++															*
*	Programmers  : Плоцкий Б.А. Фальгаров А.А.										*
*	Created      :  15/11/21														*
*	Last revision:  16/11/21														*
*	Comment(s)   : Вариант № 6														*
*																					*
*	Разработать, отладить и протестировать программу, которая  разбивает			*
*	отрезок[A; B] на N интервалов; в зависимости от значений A, B и N вычисляет		*
*	величину шага h = (B - A) / N, с которым происходит приращение аргумента		*
*	xi = A + i * h, и в каждой точке xi  печатает значения функций :				*
*																					*
*	F(xi) = (x^2 + 4) 1 / 2															*
*																					*
*	G(xi) = 4 ^ (e|x|)-1															*
*																					*
*	результаты вычислений представить в виде таблицы с элементами псевдографики.	*
*	в качестве одного из вариантов исходных данных взять : a = -1, b = 3, n = 20.	*
************************************************************************************/

#include <iostream>
#include <iomanip>
#include <Windows.h>
using namespace std;

//      П Р О Т О Т И П Ы   Ф У Н К Ц И Й
void HeadTable(); // Отрисовывает шапку таблицы
void BottomTable(); // Отрисовывает низ таблицы

//		К О Н С Т А Н Т Ы
const int WIDE = 20; // Ширина поля таблицы
const int PREC = 3;  // Количество символов после запятой

/***************************************************************
*             О С Н О В Н А Я     П Р О Г Р А М М А            *
***************************************************************/

//  Описание главной функции
int main()
{
	// Установка кодойвой страницы консоли
	SetConsoleOutputCP(65001);

	/*--------------------------------*/
	/*   Блок объявления переменных   */
	/*--------------------------------*/
	double A;		// Начало отрезка
	double B;		// Конец отрезка
	double N;		// Количество интервалов
	double h;		// Величина шага
	double x;		// Аргумент X
	double Fx;		// Функция F от x
	double Gx;		// Функция G от x
	double razn;	// Разность между B и x. Нужно для работы с точность
	double Eps;		// Точность вычислений
	bool isStop;	// Условие конца цикла для отрисовки таблицы
	int i;		// Счетчик, необходимый для таблицы

	/*---------------------------------*/	
	/*  Блок инициализации переменных  */
	/*---------------------------------*/
	N = 0;
	h = 0;
	Eps = 0.0000000000050388;
	isStop = false;
	i = 0;

	// Приглашение к вводу
	cout << "Введите A и B: ";

	// Ввод A и B
	cin >> A >> B;

	// Эхопечать
	cout << "\t Эхопечать A = " << A <<
		"\n\t Эхопечать B = " << B << endl;

	// Если введено A > B, вывести ошибку 
	if (A > B)
	{
		cout << "Ошибка, A должно быть меньше B\n";
		return 1;
	}// end if

	// Если введено A != B, вывести ошибку
	if (A != B)
	{
		cout << "Введите N: ";
		cin >> N;

		// Эхопечать
		cout << "\t Эхопечать N = " << N << endl;

		if (N <= 0)
		{
			cout << "Ошибка, должно быть N > 0\n";
			return 2;
		}

		// рассчет величины шага
		h = (B - A) / N;
	}// end if

	// Установка кодойвой страницы консоли
	SetConsoleOutputCP(437);

	// Вывод начала таблицы
	HeadTable();

	// Присваивание к x A
	x = A;

	// Вывод элементов таблицы
	while (!isStop)
	{
		// Расчет разности B и x
		razn = abs(B - x);

		// Изменение переменной isStop
		isStop = razn < Eps;

		// Вычисление F(x)
		Fx = sqrt(x * x + 4);

		// Вычисление G(x)
		Gx = 4 * exp(abs(x)) - 1;

		// Отрисовка линии таблицы
		// Столбец с i строки и значением Х
		{
			cout << "\t" << char(179) << setw(19) << setfill(char(255))
				<< setprecision(PREC) << i
				<< char(179) << fixed << setw(19) << setprecision(PREC) << x
				<< setfill(char(255));

			// Столбец со значением F
			cout << char(179) << fixed << setw(19) << setprecision(PREC) << Fx
				<< setfill(char(255));

			// Столбец со значением G
			cout << char(179) << fixed << setw(19) << setprecision(PREC) << Gx
				<< setfill(char(255)) << char(179) << endl;
		}

		// Вычисление x
		x += h;

		// Прибавление i
		i++;
	}

	// Вывод конца таблицы
	BottomTable();

	return 0;
} // end main

/**************************************************************/
/*           Р Е А Л И З А Ц И Я   Ф У Н К Ц И Й              */
/**************************************************************/

/*----------------*/
/* печать нижней  */
/* строки таблицы */
/*----------------*/
void BottomTable()
{
	cout << "\t"
		<< char(192) << setfill(char(196)) << setw(WIDE)
		<< char(193) << setfill(char(196)) << setw(WIDE)
		<< char(193) << setfill(char(196)) << setw(WIDE)
		<< char(193) << setfill(char(196)) << setw(WIDE)
		<< char(217) << endl;
}// end BottomTable()

/*------------------------*/
/* печать "шапки" таблицы */
/*------------------------*/
void HeadTable()
{
	//первая строка "шапки" таблицы
	cout << "\t"
		<< char(218) << setfill(char(196)) << setw(WIDE)
		<< char(194) << setfill(char(196)) << setw(WIDE)
		<< char(194) << setfill(char(196)) << setw(WIDE)
		<< char(194) << setfill(char(196)) << setw(WIDE)
		<< char(191) << endl;

	//вторая строка  "шапки" таблицы
	cout << "\t" << setfill(' ')
		<< char(179) << setw(WIDE - 1) << "i" << setfill(' ')
		<< char(179) << setw(WIDE - 1) << "x" << setfill(' ')
		<< char(179) << setw(WIDE - 1) << "f(x)" << setfill(' ')
		<< char(179) << setw(WIDE - 1) << "g(x)" << setfill(' ')
		<< char(179) << endl;

	//третья строка  "шапки" таблицы
	cout << "\t"
		<< char(195) << setfill(char(196)) << setw(WIDE)
		<< char(197) << setfill(char(196))
		<< setw(WIDE) << char(197)
		<< setw(WIDE) << char(197)
		<< setw(WIDE) << char(180) << endl;
} // end HeadTable()

/**********    End of main.cpp file   **********/